org/PythonBasics.org
# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+startup: overview indent auto-fill
#+export_file_name: ../html/PythonBasics.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

#+title: Python Basics
#+author: Dr. E.P. Blair

* Notebook Setup                                                   :noexport:

The following is helpful if we want to have =org-mode= sessions linking
multiple code blocks /and/ we are using =direnv=.

#+begin_src emacs-lisp :eval never-export
(setq-local org-babel-python-command (expand-file-name "./.direnv/python-3.11/bin/python3"))
#+end_src

#+RESULTS:
: /Users/enrique_blair/Library/CloudStorage/Box-Box/Teaching/GitHub/BU-ECE-IntroQuantumComputing/.direnv/python-3.11/bin/python3

#+begin_src python :results output :eval never-export
import sys

print(sys.executable)
#+end_src

#+RESULTS:
: /Users/enrique_blair/Library/CloudStorage/Box-Box/Teaching/GitHub/BU-ECE-IntroQuantumComputing/.direnv/python-3.11/bin/python3



* Variables

** Creating Variables

Values are stored in memory and accessed using variable names. This
is done using the assignment operator, ~=~, using the syntax
~<variable_name> = <expression>~. ~<expression>~ may be a value, such as ~5~, or
an expression, such as ~2 + 3~. Some basic examples are shown in Listing
[[lst:assign-variables]]: 
#+name: lst:assign-variables
#+caption: We assign avariable in Python by specifying a variable name, using the assignment operator (~=~), and then specifying a value or expression. Defined variables may be used in expressions.
#+begin_src python :exports both :session py-vars :results output :eval never-export
a = 3 # assign the value 3 to variable a
b = 5 # assign 5 to variable b
print('a+b = {0}'.format(a+b))

c = a - b # evaluate a-b, store in c
d = a/b # evaluate a/b, store in d
#+end_src

#+RESULTS: lst:assign-variables
: a+b = 8

Generally, in Python, you won't see variable values unless:
1. You are working in a Jupyter Lab notebook.
   1. In Jupyter, code is entered and evaluated in groups called
      /cells/. A cell may contain multiple lines of code.
   2. In this case, Jupyter will not display any values or graphics,
      except for the result of the last command in the cell.
2. You instruct Python to do so using the =print()= command.

Note from the author/instructor: the above code block behaves /like/
a Jupyter cell in the sense that its variables persist and are
accessible in other code blocks, so long as those code blocks participate
in the same Python session. Code blocks need not be attached to a Python
session, in which case they are stand-alone code blocks.

** Displaying Variables

In Listing [[lst:display-variables]], we print variables from the previous
code block. To do this, we use the =print()= command, which prints
strings. We either supply to the =print()= command only a variable (as in
~print(a)~), or we form strings with variable values embedded in them.
#+name: lst:display-variables
#+caption: We can use the ~print()~ command to display strings or variables.
#+begin_src python :session py-vars :results output :exports both :eval never-export
print('hello world') # print a basic string
print("hello friend") # print a basic string with alternate delimiters
print(a) # print the value of a variable
#+end_src

#+RESULTS: lst:display-variables
: hello world
: hello friend
: 3


Basic usages of ~print()~ are shown above in Listing [[lst:display-variables]]. A
more advanced usage is to use f-strings ([[https://docs.python.org/3/tutorial/inputoutput.html#formatted-string-literals][formatted string literals]]).
- To make an f-string, prepend ~f~ onto a string definition, as in ~f'hello
  world'~ or ~f"x = something"~. 
- To embed the value of a variable, say, ~x~, insert ~{x}~ in the f-string, as 
  in ~f"x = {x}"~
- To format the value of the variable embedded in the f-string, use a
  formatting string, ~:<formatSpec>~. Examples:
  - Use ~:s~ if ~x~ is a string
  - Use ~:m.nf~ to specify a decimal value with a maximum of ~m~ total
    characters (including a decimal), and ~n~ digits of precision to the right
    of the decimal
  - Use ~:0m.nf~ as in the previous case, but have leading zeros
  - Use ~:md~ to specify an integer representation with a total of ~m~ digits

#+name: lst:display-variables-fstring
#+caption: We can use ~fstrings~ (formatted strings) to embed variable values in strings. Use ~{~ and ~}~ to define placeholders for a variable value.
#+begin_src python :lines :session py-vars :results output :exports both :eval never-export
# Make an f-string (fstr) named myFirstfstr
#    This has variable values embedded within it
myFirstfstr = f'c = {c}; d = {d:5.3f}' 
print(myFirstfstr) # print the f-string

myStr = 'cat' # store a string
# embed myStr in another string
mySecondFStr = f'some word: {myStr}'
print(mySecondFStr)
#+end_src

#+RESULTS:
: hello world

