docs/PythonBasics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 19:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Basics</title>
<meta name="author" content="Dr. E.P. Blair" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Python Basics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge97ca77">1. Variables</a>
<ul>
<li><a href="#org34e355e">1.1. Creating Variables</a></li>
<li><a href="#org237cd10">1.2. Displaying Variables</a></li>
<li><a href="#orgcd2b0bf">1.3. Complex Numbers</a></li>
<li><a href="#org01a0712">1.4. Assign Multiple Variables in a Single Line</a></li>
<li><a href="#org45056c0">1.5. Variable Types</a></li>
<li><a href="#orgdbe2f9f">1.6. Boolean Variables</a></li>
</ul>
</li>
<li><a href="#if-statements">2. <code>if</code> statements</a>
<ul>
<li><a href="#if-else-statements">2.1. <code>if-else</code> Statements</a></li>
<li><a href="#if-elif-else-statements">2.2. <code>if-elif-else</code> Statements</a></li>
<li><a href="#none-in-logical-expressions">2.3. <code>None</code> in Logical Expressions</a></li>
</ul>
</li>
<li><a href="#iterables">3. Iterables</a>
<ul>
<li><a href="#strings">3.1. Strings</a></li>
<li><a href="#lists">3.2. Lists</a></li>
<li><a href="#tuples">3.3. Tuples</a></li>
<li><a href="#dicts">3.4. Dicts</a></li>
</ul>
</li>
<li><a href="#level-4-loops-and-iteration">4. Loops and Iteration</a>
<ul>
<li><a href="#defining-a-for-loop">4.1. Defining a <code>for</code> loop</a></li>
<li><a href="#a-for-loop-with-an-index">4.2. A FOR loop with an index</a></li>
<li><a href="#a-for-loop-with-an-index-1">4.3. A FOR loop with Multiple Data Sets</a>
<ul>
<li><a href="#using-a-common-index">4.3.1. Using a Common Index</a></li>
</ul>
</li>
<li><a href="#a-for-loop-without-an-index">4.4. A FOR loop without an index</a>
<ul>
<li><a href="#orgc1ac36f">4.4.1. Coding Exercise</a></li>
</ul>
</li>
<li><a href="#calculating-data-from-members-of-a-list">4.5. Calculating Data from Members of a List</a>
<ul>
<li><a href="#a-traditional-method">4.5.1. A Traditional Method</a></li>
<li><a href="#a-more-pythonic-way">4.5.2. A More Pythonic Way</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>Go back to <a href="./index.html">Table of Contents</a></i>
</p>

<div id="outline-container-orge97ca77" class="outline-2">
<h2 id="orge97ca77"><span class="section-number-2">1.</span> Variables</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org34e355e" class="outline-3">
<h3 id="org34e355e"><span class="section-number-3">1.1.</span> Creating Variables</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Values are stored in memory and accessed using variable names. This
is done using the assignment operator, <code>=</code>, using the syntax
<code>&lt;variable_name&gt; = &lt;expression&gt;</code>. <code>&lt;expression&gt;</code> may be a value, such as <code>5</code>, or
an expression, such as <code>2 + 3</code>. Some basic examples are shown in Listing
<a href="#orgb9b7190">1</a>: 
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>We assign avariable in Python by specifying a variable name, using the assignment operator (<code>=</code>), and then specifying a value or expression. Defined variables may be used in expressions.</label><pre class="src src-python" id="org1d4d95b"><span style="color: #DFAF8F;">a</span> = 3 <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">assign the value 3 to variable a</span>
<span style="color: #DFAF8F;">b</span> = 5 <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">assign 5 to variable b</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'a+b = {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(a+b))

<span style="color: #DFAF8F;">c</span> = a - b <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">evaluate a-b, store in c</span>
<span style="color: #DFAF8F;">d</span> = a/b <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">evaluate a/b, store in d</span>
</pre>
</div>

<pre class="example">
a+b = 8
</pre>


<p>
Generally, in Python, you won't see variable values unless:
</p>
<ol class="org-ol">
<li>You are working in a Jupyter Lab notebook.
<ol class="org-ol">
<li>In Jupyter, code is entered and evaluated in groups called
<i>cells</i>. A cell may contain multiple lines of code.</li>
<li>In this case, Jupyter will not display any values or graphics,
except for the result of the last command in the cell.</li>
</ol></li>
<li>You instruct Python to do so using the <code>print()</code> command.</li>
</ol>

<p>
Note from the author/instructor: the above code block behaves <i>like</i>
a Jupyter cell in the sense that its variables persist and are
accessible in other code blocks, so long as those code blocks participate
in the same Python session. Code blocks need not be attached to a Python
session, in which case they are stand-alone code blocks.
</p>
</div>
</div>

<div id="outline-container-org237cd10" class="outline-3">
<h3 id="org237cd10"><span class="section-number-3">1.2.</span> Displaying Variables</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In Listing <a href="#org06fcbb9">1</a>, we print variables from the previous
code block. To do this, we use the <code>print()</code> command, which prints
strings. We either supply to the <code>print()</code> command only a variable (as in
<code>print(a)</code>), or we form strings with variable values embedded in them.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>We can use the <code>print()</code> command to display strings or variables.</label><pre class="src src-python" id="org65ee39f"><span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'hello world'</span>) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print a basic string</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"hello friend"</span>) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print a basic string with alternate delimiters</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(a) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the value of a variable</span>
</pre>
</div>

<pre class="example">
hello world
hello friend
3
</pre>



<p>
Basic usages of <code>print()</code> are shown above in Listing <a href="#org06fcbb9">1</a>. A
more advanced usage is to use f-strings (<a href="https://docs.python.org/3/tutorial/inputoutput.html#formatted-string-literals">formatted string literals</a>).
</p>
<ul class="org-ul">
<li>To make an f-string, prepend <code>f</code> onto a string definition, as in <code>f'hello
  world'</code> or <code>f"x = something"</code>.</li>
<li>To embed the value of a variable, say, <code>x</code>, insert <code>{x}</code> in the f-string, as 
in <code>f"x = {x}"</code></li>
<li>To format the value of the variable embedded in the f-string, use a
formatting string, <code>:&lt;formatSpec&gt;</code>. Examples:
<ul class="org-ul">
<li>Use <code>:s</code> if <code>x</code> is a string</li>
<li>Use <code>:m.nf</code> to specify a decimal value with a maximum of <code>m</code> total
characters (including a decimal), and <code>n</code> digits of precision to the right
of the decimal</li>
<li>Use <code>:0m.nf</code> as in the previous case, but have leading zeros</li>
<li>Use <code>:md</code> to specify an integer representation with a total of <code>m</code> digits</li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>We can use <code>fstrings</code> (formatted strings) to embed variable values in strings. Use <code>{</code> and <code>}</code> to define placeholders for a variable value.</label><pre class="src src-python" id="org1732db9"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Make an f-string (fstr) named myFirstfstr</span>
<span style="color: #5F7F5F;">#    </span><span style="color: #7F9F7F;">This has variable values embedded within it</span>
<span style="color: #DFAF8F;">myFirstfstr</span> = f<span style="color: #CC9393;">'c = </span>{c}<span style="color: #CC9393;">; d = </span>{d:5.3f}<span style="color: #CC9393;">'</span> 
<span style="color: #DCDCCC; font-weight: bold;">print</span>(myFirstfstr) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the f-string</span>

<span style="color: #DFAF8F;">myStr</span> = <span style="color: #CC9393;">'cat'</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">store a string</span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">embed myStr in another string</span>
<span style="color: #DFAF8F;">mySecondFStr</span> = f<span style="color: #CC9393;">'some word: </span>{myStr}<span style="color: #CC9393;">'</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(mySecondFStr)
</pre>
</div>

<pre class="example">
hello world
</pre>
</div>
</div>
