org/PythonBasics.org
** Complex Numbers
Here is an example of how Python handles complex numbers. In
Python, we can use =1j= for the imaginary unit, $i$, and, say,
=5j= for $5i$.
#+begin_src python :results output :exports both :eval never-export
# Example: complex numbers
X = 3 + 2j # complex number
absX = abs(X)

# print the complex X using an f-string
#   form the f-string inside of print()
print(f'X = {X}; |X| = {absX:06.3f}')
#+end_src

#+RESULTS:
: X = (3+2j); |X| = 03.606

We also used =abs(X)= to obtain the modulus of $X$.

** Assign Multiple Variables in a Single Line
One neat trick in Python is that we can define several
variables using only one assignment statement.
#+begin_src python :results output :exports both :eval never-export
x, y, z = 1+2, 2*3, 4/5
print(f'x = {x}; y = {y}; z = {z:5.3f}')
#+end_src

#+RESULTS:
: x = 3; y = 6; z = 0.800

** Variable Types
- Variables come in different types.
  - Each variable type–or more generally, class
    (more on this later)–has a different syntax and behaviors
    governing what we can do with variables of that type
- We've encountered some different variable types by now:
  - strings - store lists of characters, as in text
  - integers - (self explanatory)
  - floating point numbers (self explanatory)
  - complex numbers - (self explanatory)
- We can interrogate the type of a variable, say, =x=, using the
  command =type(x)=
#+caption: We use the =type()= command to return the type of a variable.
#+begin_src python :results output :exports both :eval never-export
a, b, c, d = 1, 3.14, 2+3j, False

print('type of a: {0}'.format(type(a)))
print('type of b: {0}'.format(type(b)))
print('type of c: {0}'.format(type(c)))
print('type of d: {0}'.format(type(d)))
#+end_src

#+RESULTS:
: type of a: <class 'int'>
: type of b: <class 'float'>
: type of c: <class 'complex'>
: type of d: <class 'bool'>

** Boolean Variables
- We introdcued another data type: =bool=, short for /Boolean/
  - Boolean variables have one of two values: =True=, or =False=
  - These may be used to control whether sections of code get
    executed or skipped, using logical control statements
    (a.k.a. logical controls)
- Boolean variables are typically the result of a comparison
  - Comparisons may be performed between pairs of variables or values
    - Here, we must use comparison operators such as =<= (less than),
      =>= (greater than), ~==~ (equal to), =>== (grater than or equal to),
      =<== (grater than or equal to), ~!=~ (not equal to), etc.
  - Comparison operators are used to form logical expressions, which
    are evaluated as either True or False. Some examples:
    - The logical expression ~3<5~ will evaluate to =True=, but
      ~3>5~ will evaluate to ~False~
      - ~a==b~ may evaluate either to =True= or =False=, depending
        on the values stored in =a= and =b=.
        - If the two values are equal, then this statement
           evaluates to =True=
        - otherwise, it evaluates to =False=
  - The value resulting from a logical expression may be:
    - stored in a variable, which will be of the type =bool=
    - used in a logical control structure, which determines whether
      or not a block of code gets executed
#+name: lst:bool-comparisons
#+caption: Comparisons may be used to generate variables of type ~bool~.
#+begin_src python :results output :eval never-export :exports both
a = 3 < 5
b = 5 < 3
c, d, f = 3 > 5, 3 < 5, 3==5

print('type of a: {0}; a = {1}'.format(type(a), a))
print('type of b: {0}; b = {1}'.format(type(b), b))
print(f'c = {c}; d = {d}; f = {f}')
#+end_src

#+RESULTS: lst:bool-comparisons
: type of a: <class 'bool'>; a = True
: type of b: <class 'bool'>; b = False
: c = False; d = True; f = False

