docs/PythonBasics.html

<div id="outline-container-orgcd2b0bf" class="outline-3">
<h3 id="orgcd2b0bf"><span class="section-number-3">1.3.</span> Complex Numbers</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Here is an example of how Python handles complex numbers. In
Python, we can use <code>1j</code> for the imaginary unit, \(i\), and, say,
<code>5j</code> for \(5i\).
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Example: complex numbers</span>
<span style="color: #DFAF8F;">X</span> = 3 + 2j <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">complex number</span>
<span style="color: #DFAF8F;">absX</span> = <span style="color: #DCDCCC; font-weight: bold;">abs</span>(X)

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the complex X using an f-string</span>
<span style="color: #5F7F5F;">#   </span><span style="color: #7F9F7F;">form the f-string inside of print()</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'X = </span>{X}<span style="color: #CC9393;">; |X| = </span>{absX:06.3f}<span style="color: #CC9393;">'</span>)
</pre>
</div>

<pre class="example">
X = (3+2j); |X| = 03.606
</pre>


<p>
We also used <code>abs(X)</code> to obtain the modulus of \(X\).
</p>
</div>
</div>

<div id="outline-container-org01a0712" class="outline-3">
<h3 id="org01a0712"><span class="section-number-3">1.4.</span> Assign Multiple Variables in a Single Line</h3>
<div class="outline-text-3" id="text-1-4">
<p>
One neat trick in Python is that we can define several
variables using only one assignment statement.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">x</span>, <span style="color: #DFAF8F;">y</span>, <span style="color: #DFAF8F;">z</span> = 1+2, 2*3, 4/5
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'x = </span>{x}<span style="color: #CC9393;">; y = </span>{y}<span style="color: #CC9393;">; z = </span>{z:5.3f}<span style="color: #CC9393;">'</span>)
</pre>
</div>

<pre class="example">
x = 3; y = 6; z = 0.800
</pre>
</div>
</div>

<div id="outline-container-org45056c0" class="outline-3">
<h3 id="org45056c0"><span class="section-number-3">1.5.</span> Variable Types</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Variables come in different types.
<ul class="org-ul">
<li>Each variable type–or more generally, class
(more on this later)–has a different syntax and behaviors
governing what we can do with variables of that type</li>
</ul></li>
<li>We've encountered some different variable types by now:
<ul class="org-ul">
<li>strings - store lists of characters, as in text</li>
<li>integers - (self explanatory)</li>
<li>floating point numbers (self explanatory)</li>
<li>complex numbers - (self explanatory)</li>
</ul></li>
<li>We can interrogate the type of a variable, say, <code>x</code>, using the
command <code>type(x)</code></li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>We use the <code>type()</code> command to return the type of a variable.</label><pre class="src src-python"><span style="color: #DFAF8F;">a</span>, <span style="color: #DFAF8F;">b</span>, <span style="color: #DFAF8F;">c</span>, <span style="color: #DFAF8F;">d</span> = 1, 3.14, 2+3j, <span style="color: #BFEBBF;">False</span>

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of a: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(a)))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of b: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(b)))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of c: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(c)))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of d: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(d)))
</pre>
</div>

<pre class="example">
type of a: &lt;class 'int'&gt;
type of b: &lt;class 'float'&gt;
type of c: &lt;class 'complex'&gt;
type of d: &lt;class 'bool'&gt;
</pre>
</div>
</div>

<div id="outline-container-orgdbe2f9f" class="outline-3">
<h3 id="orgdbe2f9f"><span class="section-number-3">1.6.</span> Boolean Variables</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>We introdcued another data type: <code>bool</code>, short for <i>Boolean</i>
<ul class="org-ul">
<li>Boolean variables have one of two values: <code>True</code>, or <code>False</code></li>
<li>These may be used to control whether sections of code get
executed or skipped, using logical control statements
(a.k.a. logical controls)</li>
</ul></li>
<li>Boolean variables are typically the result of a comparison
<ul class="org-ul">
<li>Comparisons may be performed between pairs of variables or values
<ul class="org-ul">
<li>Here, we must use comparison operators such as <code>&lt;</code> (less than),
<code>&gt;</code> (greater than), <code>==</code> (equal to), <code>&gt;=</code> (grater than or equal to),
<code>&lt;=</code> (grater than or equal to), <code>!=</code> (not equal to), etc.</li>
</ul></li>
<li>Comparison operators are used to form logical expressions, which
are evaluated as either True or False. Some examples:
<ul class="org-ul">
<li>The logical expression <code>3&lt;5</code> will evaluate to <code>True</code>, but
<code>3&gt;5</code> will evaluate to <code>False</code>
<ul class="org-ul">
<li><code>a==b</code> may evaluate either to <code>True</code> or <code>False</code>, depending
on the values stored in <code>a</code> and <code>b</code>.
<ul class="org-ul">
<li>If the two values are equal, then this statement
evaluates to <code>True</code></li>
<li>otherwise, it evaluates to <code>False</code></li>
</ul></li>
</ul></li>
</ul></li>
<li>The value resulting from a logical expression may be:
<ul class="org-ul">
<li>stored in a variable, which will be of the type <code>bool</code></li>
<li>used in a logical control structure, which determines whether
or not a block of code gets executed</li>
</ul></li>
</ul></li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Comparisons may be used to generate variables of type <code>bool</code>.</label><pre class="src src-python" id="org987927a"><span style="color: #DFAF8F;">a</span> = 3 &lt; 5
<span style="color: #DFAF8F;">b</span> = 5 &lt; 3
<span style="color: #DFAF8F;">c</span>, <span style="color: #DFAF8F;">d</span>, <span style="color: #DFAF8F;">f</span> = 3 &gt; 5, 3 &lt; 5, 3==5

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of a: {0}; a = {1}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(a), a))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'type of b: {0}; b = {1}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(<span style="color: #DCDCCC; font-weight: bold;">type</span>(b), b))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'c = </span>{c}<span style="color: #CC9393;">; d = </span>{d}<span style="color: #CC9393;">; f = </span>{f}<span style="color: #CC9393;">'</span>)
</pre>
</div>

<pre class="example">
type of a: &lt;class 'bool'&gt;; a = True
type of b: &lt;class 'bool'&gt;; b = False
c = False; d = True; f = False
</pre>
</div>
</div>
</div>
