org/PythonBasics.org
* =if= statements
:PROPERTIES:
:CUSTOM_ID: if-statements
:END:
- ~if~ statements allow you to execute blocks of code depending on the
  value of a logical expression

- An example of this is shown in Listing [[lst:basic-if-true]].

- The basic if statement:

  - begins with if

  - identifies a variable or condition for evaluation, and

  - ends with a colon (~:~)

#+name: lst:basic-if-true
#+caption: A basic IF statement example.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both 
x = True # define a boolean (bool) variable

if x:
    # This doesn't print if x is set to False
    print('The condition x evaluates as True.') 
    # We could include other commands in the IF block
    # We only use one command here
    # Additional commands must have the same indentation
    # as the print() command

print('This is independent of the IF statement.')
#+end_src

#+RESULTS:
: The condition x evaluates as True.
: This is independent of the IF statement.

- We now repeat the code of Listing [[lst:basic-if-true]]
  in Listing [[lst:basic-if-false]].

  - Here, the ~if~ statement is evaluated as ~False~ (we set it to ~False~
    in line 1), so the =print()= command conditioned upon the ~if~ is
    never executed, so we don't see its output.

#+name: lst:basic-if-false
#+caption: A basic IF statement example with the condition set to FALSE.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both 
x = False # define a boolean (bool) variable

if x:
    # This doesn't print if x is set to False
    print('The condition x evaluates as True.')

print('This is independent of the IF statement.')
#+end_src

#+RESULTS:
: This is independent of the IF statement.

- Commands subordinate to the if statement follow it and are defined by
  their indentation. The first line of code with the same indentation as
  the if statement is outside of the if statement. Unlike other
  languages, the Python if statement is not defined using an end
  statement or a closing deliminter, but rather by returning to the
  level of indentation of the if statement itself.

** =if-else= Statements
:PROPERTIES:
:CUSTOM_ID: if-else-statements
:END:
- We can add to an =if SomeExpression:= block an =else:= block that
  provides code to be executed if the controlling logical expression
  =SomeExpression= is =False=

  - An example of this is given in Listing [[lst:if-else-basic]]

#+name: lst:if-else-basic
#+caption: A basic IF-ELSE statement example.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
y = False

if y:
    print('The condition y evaluates as True.')
else:
    print('The condition y evaluates as False.')

# The if statement is now over
print('This is independent of the IF-ELSE statement.')
#+end_src

#+RESULTS: python/exampleIF-ELSE-basic.py
: The condition y evaluates as False.
: This is independent of the IF-ELSE statement.

** =if-elif-else= Statements
:PROPERTIES:
:CUSTOM_ID: if-elif-else-statements
:END:
- We will use an =if-elif-else= statement to illustrate the use of the
  =None= value

- Python's =elif= is equivalent to else if or similar constructs in
  other languages.

- See Listing [[lst:if-elif-else]]

#+name: lst:if-elif-else
#+caption: A basic IF-ELSE statement example.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
x = None

if x is None:
    y = 100
elif x < 50:
    y = 200
else:
    y = 300

# We're outside of the if-elif-else statement now
print(f'y = {y}')
#+end_src

#+RESULTS: python/exampleIF-ELIF-ELSE-basic.py
: y = 100

** =None= in Logical Expressions
:PROPERTIES:
:CUSTOM_ID: none-in-logical-expressions
:END:
- Here is another example using =is not None= as the controlling logical
  expression:

#+name: lst:if-not-None
#+caption: A basic IF statement with an IS-NOT-NONE check.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
y = True

if y is not None:
    print('y has a value.')
#+end_src

#+RESULTS: code:python/exampleIF-not-None.py
: y has a value.

* Iterables
:PROPERTIES:
:CUSTOM_ID: iterables
:END:
- Iterables are variables that contain other variables.

  - These are useful for storing multiple related values

  - Iterables are so called because they are collections of items over
    which we may iterate (as, in a for loop, for example)

