docs/PythonBasics.html

<div id="outline-container-if-statements" class="outline-2">
<h2 id="if-statements"><span class="section-number-2">2.</span> <code>if</code> statements</h2>
<div class="outline-text-2" id="text-if-statements">
<ul class="org-ul">
<li><code>if</code> statements allow you to execute blocks of code depending on the
value of a logical expression</li>

<li>An example of this is shown in Listing <a href="#orgd9ee71d">6</a>.</li>

<li>The basic if statement:

<ul class="org-ul">
<li>begins with if</li>

<li>identifies a variable or condition for evaluation, and</li>

<li>ends with a colon (<code>:</code>)</li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>A basic IF statement example.</label><pre class="src src-python" id="orgd9ee71d"><span style="color: #DFAF8F;">x</span> = <span style="color: #BFEBBF;">True</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">define a boolean (bool) variable</span>

<span style="color: #F0DFAF; font-weight: bold;">if</span> x:
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">This doesn't print if x is set to False</span>
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The condition x evaluates as True.'</span>) 
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">We could include other commands in the IF block</span>
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">We only use one command here</span>
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Additional commands must have the same indentation</span>
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">as the print() command</span>

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'This is independent of the IF statement.'</span>)
</pre>
</div>

<pre class="example">
The condition x evaluates as True.
This is independent of the IF statement.
</pre>


<ul class="org-ul">
<li>We now repeat the code of Listing <a href="#orgd9ee71d">6</a>
in Listing <a href="#orgb9a545b">7</a>.

<ul class="org-ul">
<li>Here, the <code>if</code> statement is evaluated as <code>False</code> (we set it to <code>False</code>
in line 1), so the <code>print()</code> command conditioned upon the <code>if</code> is
never executed, so we don't see its output.</li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>A basic IF statement example with the condition set to FALSE.</label><pre class="src src-python" id="orgb9a545b"><span style="color: #DFAF8F;">x</span> = <span style="color: #BFEBBF;">False</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">define a boolean (bool) variable</span>

<span style="color: #F0DFAF; font-weight: bold;">if</span> x:
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">This doesn't print if x is set to False</span>
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The condition x evaluates as True.'</span>)

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'This is independent of the IF statement.'</span>)
</pre>
</div>

<pre class="example">
This is independent of the IF statement.
</pre>


<ul class="org-ul">
<li>Commands subordinate to the if statement follow it and are defined by
their indentation. The first line of code with the same indentation as
the if statement is outside of the if statement. Unlike other
languages, the Python if statement is not defined using an end
statement or a closing deliminter, but rather by returning to the
level of indentation of the if statement itself.</li>
</ul>
</div>

<div id="outline-container-if-else-statements" class="outline-3">
<h3 id="if-else-statements"><span class="section-number-3">2.1.</span> <code>if-else</code> Statements</h3>
<div class="outline-text-3" id="text-if-else-statements">
<ul class="org-ul">
<li>We can add to an <code>if SomeExpression:</code> block an <code>else:</code> block that
provides code to be executed if the controlling logical expression
<code>SomeExpression</code> is <code>False</code>

<ul class="org-ul">
<li>An example of this is given in Listing <a href="#org95c85e5">8</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>A basic IF-ELSE statement example.</label><pre class="src src-python" id="org95c85e5"><span style="color: #DFAF8F;">y</span> = <span style="color: #BFEBBF;">False</span>

<span style="color: #F0DFAF; font-weight: bold;">if</span> y:
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The condition y evaluates as True.'</span>)
<span style="color: #F0DFAF; font-weight: bold;">else</span>:
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The condition y evaluates as False.'</span>)

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">The if statement is now over</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'This is independent of the IF-ELSE statement.'</span>)
</pre>
</div>

<pre class="example">
The condition y evaluates as False.
This is independent of the IF-ELSE statement.
</pre>
</div>
</div>

<div id="outline-container-if-elif-else-statements" class="outline-3">
<h3 id="if-elif-else-statements"><span class="section-number-3">2.2.</span> <code>if-elif-else</code> Statements</h3>
<div class="outline-text-3" id="text-if-elif-else-statements">
<ul class="org-ul">
<li>We will use an <code>if-elif-else</code> statement to illustrate the use of the
<code>None</code> value</li>

<li>Python's <code>elif</code> is equivalent to else if or similar constructs in
other languages.</li>

<li>See Listing <a href="#org804e2bc">9</a></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>A basic IF-ELSE statement example.</label><pre class="src src-python" id="org804e2bc"><span style="color: #DFAF8F;">x</span> = <span style="color: #BFEBBF;">None</span>

<span style="color: #F0DFAF; font-weight: bold;">if</span> x <span style="color: #F0DFAF; font-weight: bold;">is</span> <span style="color: #BFEBBF;">None</span>:
    <span style="color: #DFAF8F;">y</span> = 100
<span style="color: #F0DFAF; font-weight: bold;">elif</span> x &lt; 50:
    <span style="color: #DFAF8F;">y</span> = 200
<span style="color: #F0DFAF; font-weight: bold;">else</span>:
    <span style="color: #DFAF8F;">y</span> = 300

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">We're outside of the if-elif-else statement now</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'y = </span>{y}<span style="color: #CC9393;">'</span>)
</pre>
</div>

<pre class="example">
y = 100
</pre>
</div>
</div>

<div id="outline-container-none-in-logical-expressions" class="outline-3">
<h3 id="none-in-logical-expressions"><span class="section-number-3">2.3.</span> <code>None</code> in Logical Expressions</h3>
<div class="outline-text-3" id="text-none-in-logical-expressions">
<ul class="org-ul">
<li>Here is another example using <code>is not None</code> as the controlling logical
expression:</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>A basic IF statement with an IS-NOT-NONE check.</label><pre class="src src-python" id="org2de92e7"><span style="color: #DFAF8F;">y</span> = <span style="color: #BFEBBF;">True</span>

<span style="color: #F0DFAF; font-weight: bold;">if</span> y <span style="color: #F0DFAF; font-weight: bold;">is</span> <span style="color: #F0DFAF; font-weight: bold;">not</span> <span style="color: #BFEBBF;">None</span>:
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'y has a value.'</span>)
</pre>
</div>

<pre class="example">
y has a value.
</pre>
</div>
</div>
</div>

<div id="outline-container-iterables" class="outline-2">
<h2 id="iterables"><span class="section-number-2">3.</span> Iterables</h2>
<div class="outline-text-2" id="text-iterables">
<ul class="org-ul">
<li>Iterables are variables that contain other variables.

<ul class="org-ul">
<li>These are useful for storing multiple related values</li>

<li>Iterables are so called because they are collections of items over
which we may iterate (as, in a for loop, for example)</li>
</ul></li>
</ul>
</div>
