org/PythonBasics.org
** Strings
:PROPERTIES:
:CUSTOM_ID: strings
:END:
- Strings are iterables.

  - A string, =‘cat’=, for example, is a collection of characters.

  - For a string of \(n\) characters, each character can be addressed
    using an integer index, \(\left\{ 0,1,2,\ldots,n-1\right\}\).

  - For a string stored in the variable =X=, we reference each element
    using brackets (=[= and =]=) and an integer index, =k=.

#+name: lst:string-iteration
#+caption: We extract the individual characters of a string using an index inside brackets.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = 'dog'

print('The first letter of X is "{0}".'.format(X[0]))
print('The second letter of X is "{0}".'.format(X[1]))
#+end_src

#+RESULTS: lst:string-iteration
: The first letter of X is "d".
: The second letter of X is "o".

- Now, consider a longer string

  - We may not necessarily know /a priori/ how long it is

  - We can easily address its end element using the index =-1=, or the
    second-to-last character using the index =-2=

  - Additionally, we can reference multiple contiguous elements using a
    range, =a:b=, with integers =a= and b.

    - This returns elements =X[a]= through =X[b-1]= for a
      string =X=.

  - Examples of additional string indexing are shown in Listing
    [[lst:string-index-advanced]] 

#+name: lst:string-index-advanced
#+caption: We perform additional analyses on a string.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = 'hello world'

# We can find the length of the string using len()
print('X contains {0} characters.'.format( len(X) ))

# reference from the begining of the string
print('first letter of X is "{0}".'.format(X[0]))
print('The second letter of X is "{0}".'.format(X[1]))

# reference from the end of the string
print('The last letter of X is "{0}".'.format(X[-1]))
print('The second-to-last letter of X is "{0}".'.format(X[-2]))

# slice part of the string
a, b = 2, 9
S = X[a:b]
print(f'We reference elements {a}:{b}: "{S}"')

c, d = -7, -2
R = X[c:d]
print(f'We reference elements {c}:{d}: "{R}"')
#+end_src

#+RESULTS: python/stringIndexingAdvanced.py
: X contains 11 characters.
: first letter of X is "h".
: The second letter of X is "e".
: The last letter of X is "d".
: The second-to-last letter of X is "l".
: We reference elements 2:9: "llo wor"
: We reference elements -7:-2: "o wor"

** Lists
:PROPERTIES:
:CUSTOM_ID: lists
:END:
- Lists are container variables used to contain other variables.

- Lists are flexible in that:

  - A single list may contain variables of different types

  - A list may contain other lists

- A list of several elements may be defined using brackets ([ and ])
  comma-separated elements.

  - The elements are indexed with an integer 0, 1, 2, ...

  - Individual elements may be accessed using brackets and an indexing
    integer or expression.

  - Elements may also be referenced using negative indices:

    - =-1= specifies the last element;

    - =-2= specifies the second-to-last element, etc.

#+name: lst:list-example
#+caption: We build a simple list and reference/print its values.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both 
x = 9

# form a list
myList = [x, 's', -3, 'cat', [1,2,3]]


# print the first element
print('The first element is: {0}'.format(myList[0] ) )

# print the second element
print('The second element is: {0}'.format(myList[1] ) )

# print the last element
print('The last element is: {0}'.format( myList[-1] ) )

# print the second-to-last element
print('The second-to-the-last element is: {0}'.format( myList[-2] ) )
#+end_src

#+RESULTS: python/exampleList.py
: The first element is: 9
: The second element is: s
: The last element is: [1, 2, 3]
: The second-to-the-last element is: cat

** Tuples
:PROPERTIES:
:CUSTOM_ID: tuples
:END:
- Tuples are like lists.

  - They are indexed in the same manner, but tuples are immutable.

- Tuples are defined using parentheses =(= and =)= instead of brackets
  =[= and =]=.

- Tuples are useful when you have a collection of variables and you do
  not want them altered in any way.

#+name: lst:tuple-example
#+caption: We build a simple tuple and reference/print its values.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both 
x = 9
myTup = (x, 's', -3, 'cat', [1,2,3]) # form a tuple

# print the first element
print('The first element is: {0}'.format(myTup[0] ) )

# print the second element
print('The second element is: {0}'.format(myTup[1] ) )

# print the last element
print('The last element is: {0}'.format(myTup[-1] ) )

# print the second-to-last element
print('The second-to-the-last element is: {0}'.format( myTup[-2] ) )
#+end_src

#+RESULTS: python/exampleTuple.py
: The first element is: 9
: The second element is: s
: The last element is: [1, 2, 3]
: The second-to-the-last element is: cat

