docs/PythonBasics.html

<div id="outline-container-strings" class="outline-3">
<h3 id="strings"><span class="section-number-3">3.1.</span> Strings</h3>
<div class="outline-text-3" id="text-strings">
<ul class="org-ul">
<li>Strings are iterables.

<ul class="org-ul">
<li>A string, <code>‘cat’</code>, for example, is a collection of characters.</li>

<li>For a string of \(n\) characters, each character can be addressed
using an integer index, \(\left\{ 0,1,2,\ldots,n-1\right\}\).</li>

<li>For a string stored in the variable <code>X</code>, we reference each element
using brackets (<code>[</code> and <code>]</code>) and an integer index, <code>k</code>.</li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>We extract the individual characters of a string using an index inside brackets.</label><pre class="src src-python" id="org3b8fe5c"><span style="color: #DFAF8F;">X</span> = <span style="color: #CC9393;">'dog'</span>

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The first letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[0]))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[1]))
</pre>
</div>

<pre class="example">
The first letter of X is "d".
The second letter of X is "o".
</pre>


<ul class="org-ul">
<li>Now, consider a longer string

<ul class="org-ul">
<li>We may not necessarily know <i>a priori</i> how long it is</li>

<li>We can easily address its end element using the index <code>-1</code>, or the
second-to-last character using the index <code>-2</code></li>

<li>Additionally, we can reference multiple contiguous elements using a
range, <code>a:b</code>, with integers <code>a</code> and b.

<ul class="org-ul">
<li>This returns elements <code>X[a]</code> through <code>X[b-1]</code> for a
string <code>X</code>.</li>
</ul></li>

<li>Examples of additional string indexing are shown in Listing
<a href="#org2033664">12</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 12: </span>We perform additional analyses on a string.</label><pre class="src src-python" id="org2033664"><span style="color: #DFAF8F;">X</span> = <span style="color: #CC9393;">'hello world'</span>

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">We can find the length of the string using len()</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'X contains {0} characters.'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( <span style="color: #DCDCCC; font-weight: bold;">len</span>(X) ))

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">reference from the begining of the string</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'first letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[0]))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[1]))

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">reference from the end of the string</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The last letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[-1]))
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second-to-last letter of X is "{0}".'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(X[-2]))

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">slice part of the string</span>
<span style="color: #DFAF8F;">a</span>, <span style="color: #DFAF8F;">b</span> = 2, 9
<span style="color: #DFAF8F;">S</span> = X[a:b]
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'We reference elements </span>{a}<span style="color: #CC9393;">:</span>{b}<span style="color: #CC9393;">: "</span>{S}<span style="color: #CC9393;">"'</span>)

<span style="color: #DFAF8F;">c</span>, <span style="color: #DFAF8F;">d</span> = -7, -2
<span style="color: #DFAF8F;">R</span> = X[c:d]
<span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'We reference elements </span>{c}<span style="color: #CC9393;">:</span>{d}<span style="color: #CC9393;">: "</span>{R}<span style="color: #CC9393;">"'</span>)
</pre>
</div>

<pre class="example">
X contains 11 characters.
first letter of X is "h".
The second letter of X is "e".
The last letter of X is "d".
The second-to-last letter of X is "l".
We reference elements 2:9: "llo wor"
We reference elements -7:-2: "o wor"
</pre>
</div>
</div>

<div id="outline-container-lists" class="outline-3">
<h3 id="lists"><span class="section-number-3">3.2.</span> Lists</h3>
<div class="outline-text-3" id="text-lists">
<ul class="org-ul">
<li>Lists are container variables used to contain other variables.</li>

<li>Lists are flexible in that:

<ul class="org-ul">
<li>A single list may contain variables of different types</li>

<li>A list may contain other lists</li>
</ul></li>

<li>A list of several elements may be defined using brackets ([ and ])
comma-separated elements.

<ul class="org-ul">
<li>The elements are indexed with an integer 0, 1, 2, &#x2026;</li>

<li>Individual elements may be accessed using brackets and an indexing
integer or expression.</li>

<li>Elements may also be referenced using negative indices:

<ul class="org-ul">
<li><code>-1</code> specifies the last element;</li>

<li><code>-2</code> specifies the second-to-last element, etc.</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span>We build a simple list and reference/print its values.</label><pre class="src src-python" id="orgbe12887"><span style="color: #DFAF8F;">x</span> = 9

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">form a list</span>
<span style="color: #DFAF8F;">myList</span> = [x, <span style="color: #CC9393;">'s'</span>, -3, <span style="color: #CC9393;">'cat'</span>, [1,2,3]]


<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the first element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The first element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(myList[0] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the second element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(myList[1] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the last element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The last element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( myList[-1] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the second-to-last element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second-to-the-last element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( myList[-2] ) )
</pre>
</div>

<pre class="example">
The first element is: 9
The second element is: s
The last element is: [1, 2, 3]
The second-to-the-last element is: cat
</pre>
</div>
</div>

<div id="outline-container-tuples" class="outline-3">
<h3 id="tuples"><span class="section-number-3">3.3.</span> Tuples</h3>
<div class="outline-text-3" id="text-tuples">
<ul class="org-ul">
<li>Tuples are like lists.

<ul class="org-ul">
<li>They are indexed in the same manner, but tuples are immutable.</li>
</ul></li>

<li>Tuples are defined using parentheses <code>(</code> and <code>)</code> instead of brackets
<code>[</code> and <code>]</code>.</li>

<li>Tuples are useful when you have a collection of variables and you do
not want them altered in any way.</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span>We build a simple tuple and reference/print its values.</label><pre class="src src-python" id="org5a4c494"><span style="color: #DFAF8F;">x</span> = 9
<span style="color: #DFAF8F;">myTup</span> = (x, <span style="color: #CC9393;">'s'</span>, -3, <span style="color: #CC9393;">'cat'</span>, [1,2,3]) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">form a tuple</span>

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the first element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The first element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(myTup[0] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the second element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(myTup[1] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the last element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The last element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(myTup[-1] ) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the second-to-last element</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The second-to-the-last element is: {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( myTup[-2] ) )
</pre>
</div>

<pre class="example">
The first element is: 9
The second element is: s
The last element is: [1, 2, 3]
The second-to-the-last element is: cat
</pre>
</div>
</div>
