org/PythonBasics.org
** Dicts
:PROPERTIES:
:CUSTOM_ID: dicts
:END:
- Dict is short for “dictionary”.

  - This is like a list, but elements are not indexed by number, but
    rather using a string.

  - The referncing/indexing string is called a key, and the associated
    element is called a value.

  - Thus, a dict contains key-value pairs (KPVs).

- We define a dict using braces { and }

  - KVPs are associated using a colon (:), and

  - KVPs are separated by a comma

  - dicts may be broken up over several lines of code, as can lists and
    tuples

  - Use spaces for readability

- An example of a simple dict definition is given in Listing

#+name: dict-example
#+caption: We build a simple dict.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both 
someDict = {"a": 3,
            "b": 'dog',
            "f": 5.4}

""" I used single quotes and double quotes in various places to
demonstrate their interchangeability. """

print("someDict['a'] = {0}".format(someDict['a']) )
print("someDict['f'] = {0}".format(someDict["f"]) )
print('someDict["b"] = {0}'.format(someDict['b']) )

# Now I add a value to the dict
someDict['d'] = ('New value', 19)

# Finally, I show what it looks like to print a dict
# and we show the modified dict.
print(someDict)
#+end_src

#+RESULTS: python/exampleDict.py
: someDict['a'] = 3
: someDict['f'] = 5.4
: someDict["b"] = dog
: {'a': 3, 'b': 'dog', 'f': 5.4, 'd': ('New value', 19)}

- Dicts are mutable: KVPs may be added, removed, or modified.
* Loops and Iteration
:PROPERTIES:
:CUSTOM_ID: level-4-loops-and-iteration
:END:
- Loops help us peform repeated operations over an iterable.

  - Iterables include lists, tuples, dicts, and ranges.

** Defining a =for= loop
:PROPERTIES:
:CUSTOM_ID: defining-a-for-loop
:END:
- Some key features of a =for= loop:

  - The first line of a =for= loop

    - begins with the keyword =for=,

    - defines an iterator variable, say, =x=

    - provides an iterable, say, the list =X=

    - and ends with a colon (=:=)

  - Statements to be included in the for loop follow the first line and
    are indented by a few spaces more than is the first line
    (=for x in X:=)

    - I typically use an indentation of four spaces.

  - The first statement with equal or lesser indentation than the =for=
    statement is recognized by Python to be outside of the =for= loop.

- As a first example, I define in Listing [[for-loop-example]] a list and then use
  two statements to print the elements of the list.

#+name: for-loop-example
#+caption: We define a simple =FOR= loop.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
  X = [1, 'a', (3,2,1), 'fish']
  # define a list

  # use a FOR loop to print the elements of the list
  for ix in X:
      print('Element:') # in the loop
      print(f' {ix}') # in the loop

  print('The loop has terminated.') # first statement after loop
  print('Program complete.')


#+end_src

#+RESULTS:
#+begin_example
Element:
 1
Element:
 a
Element:
 (3, 2, 1)
Element:
 fish
The loop has terminated.
Program complete.
#+end_example

** A FOR loop with an index
:PROPERTIES:
:CUSTOM_ID: a-for-loop-with-an-index
:END:
- Sometimes we don't just want to loop over the elements, but we also
  want an integer index for each element.

- To do this, we can use =enumerate=, as shown in Listing [[lst:for-enumerate]]

#+name: lst:for-enumerate
#+caption: We define a simple FOR loop.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = [5, 3, 7, 9, 8]

Z = [] # empty list
for idx, x in enumerate(X):
    print(f'X[{idx}] = {x}')
#+end_src

#+RESULTS: lst:for-enumerate
: X[0] = 5
: X[1] = 3
: X[2] = 7
: X[3] = 9
: X[4] = 8

- Notice that Python is a zero-indexed language, where the index starts
  at zero.

  - This is like C and C++, and many other languages.

- Some languages, such as Matlab or Maple, are one-indexed.

** A FOR loop with Multiple Data Sets
:PROPERTIES:
:CUSTOM_ID: a-for-loop-with-an-index-1
:END:
