docs/PythonBasics.html

<div id="outline-container-dicts" class="outline-3">
<h3 id="dicts"><span class="section-number-3">3.4.</span> Dicts</h3>
<div class="outline-text-3" id="text-dicts">
<ul class="org-ul">
<li>Dict is short for “dictionary”.

<ul class="org-ul">
<li>This is like a list, but elements are not indexed by number, but
rather using a string.</li>

<li>The referncing/indexing string is called a key, and the associated
element is called a value.</li>

<li>Thus, a dict contains key-value pairs (KPVs).</li>
</ul></li>

<li>We define a dict using braces { and }

<ul class="org-ul">
<li>KVPs are associated using a colon (:), and</li>

<li>KVPs are separated by a comma</li>

<li>dicts may be broken up over several lines of code, as can lists and
tuples</li>

<li>Use spaces for readability</li>
</ul></li>

<li>An example of a simple dict definition is given in Listing</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span>We build a simple dict.</label><pre class="src src-python" id="orgc6e68db"><span style="color: #DFAF8F;">someDict</span> = {<span style="color: #CC9393;">"a"</span>: 3,
            <span style="color: #CC9393;">"b"</span>: <span style="color: #CC9393;">'dog'</span>,
            <span style="color: #CC9393;">"f"</span>: 5.4}

<span style="color: #9FC59F;">""" I used single quotes and double quotes in various places to</span>
<span style="color: #9FC59F;">demonstrate their interchangeability. """</span>

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"someDict['a'] = {0}"</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(someDict[<span style="color: #CC9393;">'a'</span>]) )
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"someDict['f'] = {0}"</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(someDict[<span style="color: #CC9393;">"f"</span>]) )
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'someDict["b"] = {0}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(someDict[<span style="color: #CC9393;">'b'</span>]) )

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Now I add a value to the dict</span>
<span style="color: #DFAF8F;">someDict</span>[<span style="color: #CC9393;">'d'</span>] = (<span style="color: #CC9393;">'New value'</span>, 19)

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Finally, I show what it looks like to print a dict</span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">and we show the modified dict.</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(someDict)
</pre>
</div>

<pre class="example">
someDict['a'] = 3
someDict['f'] = 5.4
someDict["b"] = dog
{'a': 3, 'b': 'dog', 'f': 5.4, 'd': ('New value', 19)}
</pre>


<ul class="org-ul">
<li>Dicts are mutable: KVPs may be added, removed, or modified.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-level-4-loops-and-iteration" class="outline-2">
<h2 id="level-4-loops-and-iteration"><span class="section-number-2">4.</span> Loops and Iteration</h2>
<div class="outline-text-2" id="text-level-4-loops-and-iteration">
<ul class="org-ul">
<li>Loops help us peform repeated operations over an iterable.

<ul class="org-ul">
<li>Iterables include lists, tuples, dicts, and ranges.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-defining-a-for-loop" class="outline-3">
<h3 id="defining-a-for-loop"><span class="section-number-3">4.1.</span> Defining a <code>for</code> loop</h3>
<div class="outline-text-3" id="text-defining-a-for-loop">
<ul class="org-ul">
<li>Some key features of a <code>for</code> loop:

<ul class="org-ul">
<li>The first line of a <code>for</code> loop

<ul class="org-ul">
<li>begins with the keyword <code>for</code>,</li>

<li>defines an iterator variable, say, <code>x</code></li>

<li>provides an iterable, say, the list <code>X</code></li>

<li>and ends with a colon (<code>:</code>)</li>
</ul></li>

<li>Statements to be included in the for loop follow the first line and
are indented by a few spaces more than is the first line
(<code>for x in X:</code>)

<ul class="org-ul">
<li>I typically use an indentation of four spaces.</li>
</ul></li>

<li>The first statement with equal or lesser indentation than the <code>for</code>
statement is recognized by Python to be outside of the <code>for</code> loop.</li>
</ul></li>

<li>As a first example, I define in Listing <a href="#org63ac733">16</a> a list and then use
two statements to print the elements of the list.</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span>We define a simple <code>FOR</code> loop.</label><pre class="src src-python" id="org63ac733"><span style="color: #DFAF8F;">X</span> = [1, <span style="color: #CC9393;">'a'</span>, (3,2,1), <span style="color: #CC9393;">'fish'</span>]
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">define a list</span>

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">use a FOR loop to print the elements of the list</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> ix <span style="color: #F0DFAF; font-weight: bold;">in</span> X:
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'Element:'</span>) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">in the loop</span>
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">' </span>{ix}<span style="color: #CC9393;">'</span>) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">in the loop</span>

<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'The loop has terminated.'</span>) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">first statement after loop</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'Program complete.'</span>)


</pre>
</div>

<pre class="example" id="org65e88ed">
Element:
 1
Element:
 a
Element:
 (3, 2, 1)
Element:
 fish
The loop has terminated.
Program complete.
</pre>
</div>
</div>

<div id="outline-container-a-for-loop-with-an-index" class="outline-3">
<h3 id="a-for-loop-with-an-index"><span class="section-number-3">4.2.</span> A FOR loop with an index</h3>
<div class="outline-text-3" id="text-a-for-loop-with-an-index">
<ul class="org-ul">
<li>Sometimes we don't just want to loop over the elements, but we also
want an integer index for each element.</li>

<li>To do this, we can use <code>enumerate</code>, as shown in Listing <a href="#orgc243874">1</a></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span>We define a simple FOR loop.</label><pre class="src src-python" id="org31acb22"><span style="color: #DFAF8F;">X</span> = [5, 3, 7, 9, 8]

<span style="color: #DFAF8F;">Z</span> = [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">empty list</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> idx, x <span style="color: #F0DFAF; font-weight: bold;">in</span> <span style="color: #DCDCCC; font-weight: bold;">enumerate</span>(X):
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(f<span style="color: #CC9393;">'X[</span>{idx}<span style="color: #CC9393;">] = </span>{x}<span style="color: #CC9393;">'</span>)
</pre>
</div>

<pre class="example">
X[0] = 5
X[1] = 3
X[2] = 7
X[3] = 9
X[4] = 8
</pre>


<ul class="org-ul">
<li>Notice that Python is a zero-indexed language, where the index starts
at zero.

<ul class="org-ul">
<li>This is like C and C++, and many other languages.</li>
</ul></li>

<li>Some languages, such as Matlab or Maple, are one-indexed.</li>
</ul>
</div>
</div>

<div id="outline-container-a-for-loop-with-an-index-1" class="outline-3">
<h3 id="a-for-loop-with-an-index-1"><span class="section-number-3">4.3.</span> A FOR loop with Multiple Data Sets</h3>
<div class="outline-text-3" id="text-a-for-loop-with-an-index-1">
</div>
