org/PythonBasics.org
*** Using a Common Index
:PROPERTIES:
:CUSTOM_ID: using-a-common-index
:END:
- Sometimes we want to use multiple data sets.

- For example, we may want to add the elements of a list =X= to the
  corresponding elements of another list, =Y=.

  - We could use an enumerate object, as before; or,

  - we may use a range object to obtain an *index* to address
    corresponding elements of the various lists.

- I'll demonstrate the use of a range in Listing [[lst:for-range]]

  - We make a range that starts at 0 and ends at a number just high
    enough to capture all the elements of =X=.

  - We also assume that =X= and =Y= have the same number of elements.
#+name: lst:for-range
#+caption: We define a simple =FOR= loop that iterates over a range to process two lists.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = [5, 3, 7, 9, 8]
Y = [1, 4, 2, 11, 6]

Z = [] # empty list
for idx in range(0, len(X)):
    newZelement = X[idx] + Y[idx]
    Z.append( newZelement ) # add newZelement to Z
    print('X[{0}] + Y[{0}] = {1} + {2} = {3}'.format(idx, X[idx], Y[idx], Z[idx]) )

print(Z)
#+end_src

#+RESULTS:
: X[0] + Y[0] = 5 + 1 = 6
: X[1] + Y[1] = 3 + 4 = 7
: X[2] + Y[2] = 7 + 2 = 9
: X[3] + Y[3] = 9 + 11 = 20
: X[4] + Y[4] = 8 + 6 = 14
: [6, 7, 9, 20, 14]


- The loop contains three instructions:

  - Add the indexed elements of =X= and =Y=, storing this result in
    =newZelement=

  - Append =newZelement= to =Z=.

  - Print data so we know it worked properly.

- We could combine the first two instructions into one, as in Listing
  [[lst:for-range]]: 
#+name: lst:for-range
#+caption: We define a simple FOR loop that iterates an index over a range to process two lists.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export
X = [5, 3, 7, 9, 8]
Y = [1, 4, 2, 11, 6]

Z = [] # empty list
for x,y in zip(X, Y):
    Z.append( x + y ) # add to Z

    print('x + y = 0 + 1 = 2'.format( x, y, Z[-1]) )

print(Z)
#+end_src

#+RESULTS:
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: [6, 7, 9, 20, 14]

** A FOR loop without an index
:PROPERTIES:
:CUSTOM_ID: a-for-loop-without-an-index
:END:
- We may work with two data lists without making a common index.

- In this technique, we iterate over two lists simultaneously using zip
  (see Listing [[lst:for-zip]]):
#+name: lst:for-zip
#+caption: We define a simple FOR loop that process two lists without an index.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = [5, 3, 7, 9, 8]
Y = [1, 4, 2, 11, 6]

Z = [] # empty list
for x,y in zip(X, Y):
    Z.append( x + y ) # add to Z
    print('x + y = 0 + 1 = 2'.format( x, y, Z[-1]) )

print(Z)
#+end_src

#+RESULTS:
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: x + y = 0 + 1 = 2
: [6, 7, 9, 20, 14]

*** Coding Exercise
Use ~zip~ and a ~for~ loop to make Python print each first name and last
name together in pairs on a single line. For example, the first result
should contain =Sargon Akkad=.

#+name: lst-coding-ex-names
#+caption: Coding Exercise. Copy this code block into a Jupyter cell and complet the task described for this exercise.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
FirstName = ['Sargon', 'Ambrose', 'Joan', 'Augustine']
LastName = ['Akkad', 'Milan', 'Arc', 'Hippo']
#+end_src

** Calculating Data from Members of a List
:PROPERTIES:
:CUSTOM_ID: calculating-data-from-members-of-a-list
:END:
*** A Traditional Method
:PROPERTIES:
:CUSTOM_ID: a-traditional-method
:END:
The first method we showcase here is very intuitive: it is the way we
might do this in another language. We start with a list, =X=, and we
calculate a new list =Y=, whose elements correspond to the square of the
elements in =X=:

#+name: lst:coding-exercise-list-calc
#+Caption: A list =Y= is calculated from the values of another list, =X=, using a =for= loop.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
   X = [1, 2, 3, 4]

   Y = [] # define an empty storage list

   for x in X:
       Y.append( x**2 )

   print(X)
   print(Y)
#+end_src

#+RESULTS:
: [1, 2, 3, 4]
: [1, 4, 9, 16]

