docs/PythonBasics.html
<div id="outline-container-using-a-common-index" class="outline-4">
<h4 id="using-a-common-index"><span class="section-number-4">4.3.1.</span> Using a Common Index</h4>
<div class="outline-text-4" id="text-using-a-common-index">
<ul class="org-ul">
<li>Sometimes we want to use multiple data sets.</li>

<li>For example, we may want to add the elements of a list <code>X</code> to the
corresponding elements of another list, <code>Y</code>.

<ul class="org-ul">
<li>We could use an enumerate object, as before; or,</li>

<li>we may use a range object to obtain an <b>index</b> to address
corresponding elements of the various lists.</li>
</ul></li>

<li>I'll demonstrate the use of a range in Listing <a href="#org28cf019">19</a>

<ul class="org-ul">
<li>We make a range that starts at 0 and ends at a number just high
enough to capture all the elements of <code>X</code>.</li>

<li>We also assume that <code>X</code> and <code>Y</code> have the same number of elements.</li>
</ul></li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span>We define a simple <code>FOR</code> loop that iterates over a range to process two lists.</label><pre class="src src-python" id="orgd7a3109"><span style="color: #DFAF8F;">X</span> = [5, 3, 7, 9, 8]
<span style="color: #DFAF8F;">Y</span> = [1, 4, 2, 11, 6]

<span style="color: #DFAF8F;">Z</span> = [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">empty list</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> idx <span style="color: #F0DFAF; font-weight: bold;">in</span> <span style="color: #DCDCCC; font-weight: bold;">range</span>(0, <span style="color: #DCDCCC; font-weight: bold;">len</span>(X)):
    <span style="color: #DFAF8F;">newZelement</span> = X[idx] + Y[idx]
    Z.append( newZelement ) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">add newZelement to Z</span>
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'X[{0}] + Y[{0}] = {1} + {2} = {3}'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>(idx, X[idx], Y[idx], Z[idx]) )

<span style="color: #DCDCCC; font-weight: bold;">print</span>(Z)
</pre>
</div>

<pre class="example">
X[0] + Y[0] = 5 + 1 = 6
X[1] + Y[1] = 3 + 4 = 7
X[2] + Y[2] = 7 + 2 = 9
X[3] + Y[3] = 9 + 11 = 20
X[4] + Y[4] = 8 + 6 = 14
[6, 7, 9, 20, 14]
</pre>



<ul class="org-ul">
<li>The loop contains three instructions:

<ul class="org-ul">
<li>Add the indexed elements of <code>X</code> and <code>Y</code>, storing this result in
<code>newZelement</code></li>

<li>Append <code>newZelement</code> to <code>Z</code>.</li>

<li>Print data so we know it worked properly.</li>
</ul></li>

<li>We could combine the first two instructions into one, as in Listing
<a href="#org28cf019">19</a>:</li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span>We define a simple FOR loop that iterates an index over a range to process two lists.</label><pre class="src src-python" id="org28cf019"><span style="color: #DFAF8F;">X</span> = [5, 3, 7, 9, 8]
<span style="color: #DFAF8F;">Y</span> = [1, 4, 2, 11, 6]

<span style="color: #DFAF8F;">Z</span> = [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">empty list</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> x,y <span style="color: #F0DFAF; font-weight: bold;">in</span> <span style="color: #DCDCCC; font-weight: bold;">zip</span>(X, Y):
    Z.append( x + y ) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">add to Z</span>

    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'x + y = 0 + 1 = 2'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( x, y, Z[-1]) )

<span style="color: #DCDCCC; font-weight: bold;">print</span>(Z)
</pre>
</div>

<pre class="example">
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
[6, 7, 9, 20, 14]
</pre>
</div>
</div>
</div>

<div id="outline-container-a-for-loop-without-an-index" class="outline-3">
<h3 id="a-for-loop-without-an-index"><span class="section-number-3">4.4.</span> A FOR loop without an index</h3>
<div class="outline-text-3" id="text-a-for-loop-without-an-index">
<ul class="org-ul">
<li>We may work with two data lists without making a common index.</li>

<li>In this technique, we iterate over two lists simultaneously using zip
(see Listing <a href="#org989aa48">20</a>):</li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 20: </span>We define a simple FOR loop that process two lists without an index.</label><pre class="src src-python" id="org989aa48"><span style="color: #DFAF8F;">X</span> = [5, 3, 7, 9, 8]
<span style="color: #DFAF8F;">Y</span> = [1, 4, 2, 11, 6]

<span style="color: #DFAF8F;">Z</span> = [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">empty list</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> x,y <span style="color: #F0DFAF; font-weight: bold;">in</span> <span style="color: #DCDCCC; font-weight: bold;">zip</span>(X, Y):
    Z.append( x + y ) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">add to Z</span>
    <span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'x + y = 0 + 1 = 2'</span>.<span style="color: #DCDCCC; font-weight: bold;">format</span>( x, y, Z[-1]) )

<span style="color: #DCDCCC; font-weight: bold;">print</span>(Z)
</pre>
</div>

<pre class="example">
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
x + y = 0 + 1 = 2
[6, 7, 9, 20, 14]
</pre>
</div>

<div id="outline-container-orgc1ac36f" class="outline-4">
<h4 id="orgc1ac36f"><span class="section-number-4">4.4.1.</span> Coding Exercise</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Use <code>zip</code> and a <code>for</code> loop to make Python print each first name and last
name together in pairs on a single line. For example, the first result
should contain <code>Sargon Akkad</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 21: </span>Coding Exercise. Copy this code block into a Jupyter cell and complet the task described for this exercise.</label><pre class="src src-python" id="org3e0d8de"><span style="color: #DFAF8F;">FirstName</span> = [<span style="color: #CC9393;">'Sargon'</span>, <span style="color: #CC9393;">'Ambrose'</span>, <span style="color: #CC9393;">'Joan'</span>, <span style="color: #CC9393;">'Augustine'</span>]
<span style="color: #DFAF8F;">LastName</span> = [<span style="color: #CC9393;">'Akkad'</span>, <span style="color: #CC9393;">'Milan'</span>, <span style="color: #CC9393;">'Arc'</span>, <span style="color: #CC9393;">'Hippo'</span>]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-calculating-data-from-members-of-a-list" class="outline-3">
<h3 id="calculating-data-from-members-of-a-list"><span class="section-number-3">4.5.</span> Calculating Data from Members of a List</h3>
<div class="outline-text-3" id="text-calculating-data-from-members-of-a-list">
</div>
<div id="outline-container-a-traditional-method" class="outline-4">
<h4 id="a-traditional-method"><span class="section-number-4">4.5.1.</span> A Traditional Method</h4>
<div class="outline-text-4" id="text-a-traditional-method">
<p>
The first method we showcase here is very intuitive: it is the way we
might do this in another language. We start with a list, <code>X</code>, and we
calculate a new list <code>Y</code>, whose elements correspond to the square of the
elements in <code>X</code>:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 22: </span>A list <code>Y</code> is calculated from the values of another list, <code>X</code>, using a <code>for</code> loop.</label><pre class="src src-python" id="org05b1c11"><span style="color: #DFAF8F;">X</span> = [1, 2, 3, 4]

<span style="color: #DFAF8F;">Y</span> = [] <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">define an empty storage list</span>

<span style="color: #F0DFAF; font-weight: bold;">for</span> x <span style="color: #F0DFAF; font-weight: bold;">in</span> X:
    Y.append( x**2 )

<span style="color: #DCDCCC; font-weight: bold;">print</span>(X)
<span style="color: #DCDCCC; font-weight: bold;">print</span>(Y)
</pre>
</div>

<pre class="example">
[1, 2, 3, 4]
[1, 4, 9, 16]
</pre>
</div>
</div>
