org/PythonBasics.org
*** A More Pythonic Way
:PROPERTIES:
:CUSTOM_ID: a-more-pythonic-way
:END:
A more Pythonic method for calculating =Y= is to use a *list
comprehension*. Here, we define a list using the brackets again, =[= and
=]=. Inside the brackets, we include:

1. an expression using a =for=-loop variable,

2. the keyword =for=

3. a declaration of the loop variable =x=

4. the keyword =in=

5. the iterable, =X=, over which we iterate

It looks like the following:

#+name: lst:list-comprehension
#+Caption: A list =Y= is calculated from the values of another list, =X=, using a list comprehension.
#+attr_latex: :options numbers=left
#+begin_src python :results output :eval never-export :exports both
X = list(range(1,13))

# Form an array of squared values (list comprehension)
Y = [x**2 for x in X]

print(X)
print(Y)

#+end_src

#+RESULTS:
: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
: [1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144]

Notice the syntax for the list comprehension is very English-like: we're
instructing Python to define a list =Y= whose elements are =x**2= (=x=
squared) for each =x= in the list =X=.
