docs/PythonBasics.html

<div id="outline-container-a-more-pythonic-way" class="outline-4">
<h4 id="a-more-pythonic-way"><span class="section-number-4">4.5.2.</span> A More Pythonic Way</h4>
<div class="outline-text-4" id="text-a-more-pythonic-way">
<p>
A more Pythonic method for calculating <code>Y</code> is to use a <b>list
comprehension</b>. Here, we define a list using the brackets again, <code>[</code> and
<code>]</code>. Inside the brackets, we include:
</p>

<ol class="org-ol">
<li>an expression using a <code>for</code>-loop variable,</li>

<li>the keyword <code>for</code></li>

<li>a declaration of the loop variable <code>x</code></li>

<li>the keyword <code>in</code></li>

<li>the iterable, <code>X</code>, over which we iterate</li>
</ol>

<p>
It looks like the following:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 23: </span>A list <code>Y</code> is calculated from the values of another list, <code>X</code>, using a list comprehension.</label><pre class="src src-python" id="org46ddd7c"><span style="color: #DFAF8F;">X</span> = <span style="color: #DCDCCC; font-weight: bold;">list</span>(<span style="color: #DCDCCC; font-weight: bold;">range</span>(1,13))

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Form an array of squared values (list comprehension)</span>
<span style="color: #DFAF8F;">Y</span> = [x**2 <span style="color: #F0DFAF; font-weight: bold;">for</span> x <span style="color: #F0DFAF; font-weight: bold;">in</span> X]

<span style="color: #DCDCCC; font-weight: bold;">print</span>(X)
<span style="color: #DCDCCC; font-weight: bold;">print</span>(Y)

</pre>
</div>

<pre class="example">
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144]
</pre>


<p>
Notice the syntax for the list comprehension is very English-like: we're
instructing Python to define a list <code>Y</code> whose elements are <code>x**2</code> (<code>x</code>
squared) for each <code>x</code> in the list <code>X</code>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dr. E.P. Blair</p>
<p class="date">Created: 2025-01-17 Fri 19:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
